/* Welcome to the SQL mini project. You will carry out this project partly in
the PHPMyAdmin interface, and partly in Jupyter via a Python connection.

This is Tier 2 of the case study, which means that there'll be less guidance for you about how to setup
your local SQLite connection in PART 2 of the case study. This will make the case study more challenging for you: 
you might need to do some digging, aand revise the Working with Relational Databases in Python chapter in the previous resource.

Otherwise, the questions in the case study are exactly the same as with Tier 1. 

PART 1: PHPMyAdmin
You will complete questions 1-9 below in the PHPMyAdmin interface. 
Log in by pasting the following URL into your browser, and
using the following Username and Password:

URL: https://sql.springboard.com/
Username: student
Password: learn_sql@springboard

The data you need is in the "country_club" database. This database
contains 3 tables:
    i) the "Bookings" table,
    ii) the "Facilities" table, and
    iii) the "Members" table.

In this case study, you'll be asked a series of questions. You can
solve them using the platform, but for the final deliverable,
paste the code for each solution into this script, and upload it
to your GitHub.

Before starting with the questions, feel free to take your time,
exploring the data, and getting acquainted with the 3 tables. */


/* QUESTIONS 
/* Q1: Some of the facilities charge a fee to members, but some do not.
Write a SQL query to produce a list of the names of the facilities that do. */
select name as Facility from Facilities where membercost > 0.0;

/* Q2: How many facilities do not charge a fee to members? */
select count(*) from Facilities where membercost = 0.0;

/* Q3: Write an SQL query to show a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost.
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question. */
select facid,name as facility_name,membercost,monthlymaintenance
from Facilities
where membercost > monthlymaintenance * 0.2;

/* Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
Try writing the query without using the OR operator. */
select * from Facilities where facid in (1,5);

/* Q5: Produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100. Return the name and monthly maintenance of the facilities
in question. */
select 	name,
		monthlymaintenance,
	CASE WHEN monthlymaintenance > 100
			THEN 'Expensive'
		 WHEN monthlymaintenance <= 100 
			THEN 'Cheap' END AS Type
from Facilities;


/* Q6: You'd like to get the first and last name of the last member(s)
who signed up. Try not to use the LIMIT clause for your solution. */
select firstname,surname 
from Members
where joindate = 
	(select max(joindate) from Members);

/* Q7: Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name. */
select 
	distinct (concat_ws(" ",f.name,m.firstname,m.surname)) as Facility_Member
from Bookings as b
left join Facilities as f
	on f.facid = b.facid
left join Members as m
	on b.memid = m.memid
where b.facid in (
	(select facid 
     from Facilities 
     where name like 'Tennis%'))
order by concat(m.firstname,m.surname);

/* Q8: Produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30. Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries. */
select 
	f.name as Facility,
    concat_ws(" ",m.firstname,m.surname) as Member,
	CASE WHEN b.memid = 0 
			THEN (f.guestcost * slots)
		ELSE (f.membercost * slots) END AS cost
from Bookings as b
left join Facilities as f
	on f.facid = b.facid
left join Members as m
	on b.memid = m.memid
where Date(starttime) = '2012-09-14'
	and (CASE WHEN b.memid = 0 
			THEN (f.guestcost * slots) > 30
		 ELSE (f.membercost * slots) > 30 
         END)
order by cost desc;

/* Q9: This time, produce the same result as in Q8, but using a subquery. */
select 
	sub.name as Facility,
	concat_ws(" ",m.firstname,m.surname) as Member,
	cost
from 
	(select
     f.name,
     b.memid,
     f.facid,
     starttime,
     CASE WHEN b.memid = 0 
			THEN (f.guestcost * slots)
		ELSE (f.membercost * slots) END AS cost
     from Bookings as b
     left join Facilities as f
     	on b.facid = f.facid) as sub
left join Members as m
	on sub.memid = m.memid
where Date(starttime) = '2012-09-14'
	and cost > 30
order by cost desc;

**PART 2: SQLite**

Export the country club data from PHPMyAdmin, and connect to a local SQLite instance from Jupyter notebook 
for the following questions.

In [20]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine('sqlite:////Users/vaishali/Documents/DataScienceProjects/Unit8-SQL/country_club.sqlite')

**Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!**

In [21]:
table_names = engine.table_names()
print(table_names)

['Bookings', 'Facilities', 'Members']

In [162]:
query_q10 = "select\
	sub.name as Facility,\
	sum(sub.total_cost) as Revenue \
from \
(select\
	f.facid,name,guestcost,membercost,b.bookid,b.memid,slots,\
	CASE WHEN b.memid = '0' \
			THEN (guestcost * slots) \
        ELSE  (membercost * slots) END AS total_cost \
	from Facilities as f \
	left join Bookings as b\
	using (facid)) as sub \
group by sub.name \
having Revenue < 1000 \
order by Revenue;"

In [167]:
df = pd.read_sql_query(query_q10, engine)

df.head()

        Facility  Revenue
0   Table Tennis    180.0
1  Snooker Table    240.0
2     Pool Table    270.0

**Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order**

In [178]:
query_q11 = 'select\
                m.surname,m.firstname,\
                replace(rec_by.firstname || " " || rec_by.surname,"GUEST GUEST","NA") as Recommended_By\
            from Members as m\
            Left join Members as rec_by\
            on m.recommendedby = rec_by.memid\
            where m.memid <> "0"\
            order by m.surname,m.firstname;'

In [179]:
df = pd.read_sql_query(query_q11, engine)
df.head(50)

              surname  firstname     Recommended_By
0               Bader   Florence    Ponder Stibbons
1               Baker       Anne    Ponder Stibbons
2               Baker    Timothy     Jemima Farrell
3              Boothe        Tim         Tim Rownam
4             Butters     Gerald       Darren Smith
5              Coplin       Joan      Timothy Baker
6             Crumpet      Erica        Tracy Smith
7                Dare      Nancy    Janice Joplette
8             Farrell      David               None
9             Farrell     Jemima               None
10            Genting    Matthew     Gerald Butters
11               Hunt       John  Millicent Purview
12              Jones      David    Janice Joplette
13              Jones    Douglas        David Jones
14           Joplette     Janice       Darren Smith
15          Mackenzie       Anna       Darren Smith
16               Owen    Charles       Darren Smith
17             Pinker      David     Jemima Farrell
18            Purview  Millicent        Tracy Smith
19             Rownam        Tim               None
20             Rumney  Henrietta    Matthew Genting
21             Sarwin  Ramnaresh     Florence Bader
22              Smith     Darren               None
23              Smith     Darren               None
24              Smith       Jack       Darren Smith
25              Smith      Tracy               None
26           Stibbons     Ponder       Burton Tracy
27              Tracy     Burton               None
28         Tupperware   Hyacinth               None
29  Worthington-Smyth      Henry        Tracy Smith

**Q12: Find the facilities with their usage by member, but not guests**

In [183]:
query_q12 = "select \
	f.name as Facility,\
	m.firstname || ' ' || m.surname as Member,\
	sum(slots) as 'Usage - No of slots' \
from Bookings as b \
left join Facilities as f \
	using (facid) \
left join Members as m \
	using (memid) \
where b.memid <> '0' \
group by Facility,Member;"

In [184]:
df = pd.read_sql_query(query_q12, engine)
df.head(50)

           Facility                   Member  Usage - No of slots
0   Badminton Court           Anna Mackenzie                   96
1   Badminton Court               Anne Baker                   30
2   Badminton Court             Burton Tracy                    6
3   Badminton Court             Charles Owen                   18
4   Badminton Court             Darren Smith                  432
5   Badminton Court              David Jones                   24
6   Badminton Court             David Pinker                   21
7   Badminton Court            Douglas Jones                    6
8   Badminton Court            Erica Crumpet                    6
9   Badminton Court           Florence Bader                   27
10  Badminton Court           Gerald Butters                   63
11  Badminton Court  Henry Worthington-Smyth                   15
12  Badminton Court      Hyacinth Tupperware                    3
13  Badminton Court               Jack Smith                   36
14  Badminton Court           Jemima Farrell                   21
15  Badminton Court                John Hunt                    6
16  Badminton Court        Millicent Purview                    6
17  Badminton Court               Nancy Dare                   30
18  Badminton Court          Ponder Stibbons                   48
19  Badminton Court         Ramnaresh Sarwin                   21
20  Badminton Court               Tim Boothe                   36
21  Badminton Court               Tim Rownam                   12
22  Badminton Court            Timothy Baker                   21
23  Badminton Court              Tracy Smith                  102
24   Massage Room 1           Anna Mackenzie                    2
25   Massage Room 1               Anne Baker                    6
26   Massage Room 1             Burton Tracy                   62
27   Massage Room 1             Charles Owen                   22
28   Massage Room 1             Darren Smith                   58
29   Massage Room 1              David Jones                   40
30   Massage Room 1             David Pinker                    6
31   Massage Room 1            Erica Crumpet                    4
32   Massage Room 1           Gerald Butters                   66
33   Massage Room 1  Henry Worthington-Smyth                    2
34   Massage Room 1      Hyacinth Tupperware                    2
35   Massage Room 1               Jack Smith                   54
36   Massage Room 1          Janice Joplette                   24
37   Massage Room 1           Jemima Farrell                   68
38   Massage Room 1              Joan Coplin                    2
39   Massage Room 1                John Hunt                    6
40   Massage Room 1          Matthew Genting                   52
41   Massage Room 1               Nancy Dare                   38
42   Massage Room 1          Ponder Stibbons                   40
43   Massage Room 1         Ramnaresh Sarwin                   16
44   Massage Room 1               Tim Boothe                   76
45   Massage Room 1               Tim Rownam                  176
46   Massage Room 1            Timothy Baker                   50
47   Massage Room 1              Tracy Smith                   12
48   Massage Room 2               Anne Baker                    4
49   Massage Room 2             Charles Owen                    4

**Q13: Find the facilities usage by month, but not guests**

In [195]:
query_q13 = "select \
	f.name as Facility,\
	strftime('%m',starttime) as Month,\
	sum(slots) as 'Usage - No of slots' \
from Bookings as b \
left join Facilities as f \
	using (facid) \
where b.memid != '0' \
group by Facility,Month;"

In [196]:
df = pd.read_sql_query(query_q13, engine)
df.head(50)

           Facility Month  Usage - No of slots
0   Badminton Court    07                  165
1   Badminton Court    08                  414
2   Badminton Court    09                  507
3    Massage Room 1    07                  166
4    Massage Room 1    08                  316
5    Massage Room 1    09                  402
6    Massage Room 2    07                    8
7    Massage Room 2    08                   18
8    Massage Room 2    09                   28
9        Pool Table    07                  110
10       Pool Table    08                  303
11       Pool Table    09                  443
12    Snooker Table    07                  140
13    Snooker Table    08                  316
14    Snooker Table    09                  404
15     Squash Court    07                   50
16     Squash Court    08                  184
17     Squash Court    09                  184
18     Table Tennis    07                   98
19     Table Tennis    08                  296
20     Table Tennis    09                  400
21   Tennis Court 1    07                  201
22   Tennis Court 1    08                  339
23   Tennis Court 1    09                  417
24   Tennis Court 2    07                  123
25   Tennis Court 2    08                  345
26   Tennis Court 2    09                  414